/*1. Условие на задачата
    1.1 Базова функционалност (80 точки)
    Разработка на прототип на игра тип страетгия в реално време (real time strategy)*.
    Подобно на други RTS игри, когато играта стартира, един играч разполага с 5
    работници(строители), командна база и 0 ресурси. Целта на играча е да построи
    сграда казарма и да обучи 20 войника, след което играта приключва. Сградите и
    войниците струват ресурси, които се набавят с помощта на работниците. Играчът
    подава команди на стандартния вход(stdin). Целта на задачата е да се реализира
    синхронизация на нишки посредством mutex-и и condvar-и.
    */
    
    
    /*
        1.1.1 Работници Работниците служат за добиване на ресурси и строене на
        сгради. Изпълняват следната поредица от действия:
            1 – Намиране на ресурси (симулира се време, 2s).
            Преди започването на търсенето на стандартния изход трябва да се изведе съобщението –
            “Worker N is searching”, където N е поредният номер на работника.
            *Части от условието са заимствани от задачи по ОС от ТУЕС към ТУ – София и творби на Blizzard
            2 - Транспортиране на ресурсите до свободнa командна база (симулира
            се време, 2s).
            При стартиране на транспортирането трябва да се изведе - “Worker N is transporting”.
            3 - Разтоварване на ресурсите (симулира се време, 1s).
            След успешно разтоварване трябва да се изведе - “Worker N unloaded resources to Base station”.
            4 - (Връщане на стъпка 1).
            
            При всяко търсене се добиват ресурси с големина 4. Всеки работник трябва
            да се изпълнява в отделна нишка. При изчерпване на ресурсите на картата
            нишките на работниците трябва да прекратят изпълнението си.
            По време на стъпка 1. работникът може да получи команда за построяване на сграда.
            Командата за построяване на сграда се обслужва от кой да е работник, който е в режим
            намиране на ресурси. Ако в момента на получаване на командата играчът не разполага
            с необходимите ресурси за построяване на казармата, се изписва съобщение „ Not
            enough resources” и работникът продължава своята нормална функция по събиране на
            ресурс Процедурата по строене на сграда е следната:
                1- Изваждане на необходимия брой ресурси за сградата от общия брой
                ресурси, с които играчът разполага
                2- Конструиране на сградата( симулира се време, 20s )
                При стартиране на конструирането трябва да се изведе - “Worker N is constructing
                new building &lt;building_type&gt;”.
                3- Приключване на конструирането на сградата – работникът се връща
                към обичайната си дейност от събиране на ресурси от стъпка 1.
                При приключване на конструирането трябва да се изведе - “Worker N completed new
                building &lt;building_type&gt;”.
    */
    /*    
        1.1.2 Командни бази Командните бази служат като място
        за разтоварване на ресурси. Изисквания:
            • В Командната база трябва да може да се разтоварват
            • Само по един работник може да разтоварва ресурси в конкретна
            Командна база по едно и също време.
    */
    /*
        1.1.3 Казарми Казармите служат за
        обучение на войници. Изисквания:
            • Обучаването на войник струва 25 минерала и се симулира време за обучение 2s.
            При начало на обучение на войник трябва да се изведе съобщение „ Warrior
            is being trained”. Само по един войник може да се обучава в даден
            момент от време. След обучението на войник трябва да се изведе
            съобщението “Warrior is ready for duty”.
            
    */
    /*
        1.1.4 Команди подавани от играча Командите се подават от играча на
        стандартния вход. Възможните команди са:
            - “b” за да се построи сграда тип казарма – building_type=barracks;
            - “w” за да се обучи нов войник. Ако няма построена сграда казарма,
            трябва да се изведе съобщение: Operation not supported.
    */
    /*
        1.1.5 Общи
            • На картата има 4096 ресурса.
            • Общият брой работници и войници не може да надвишава 100.
            • Всички нишки трябва да работят паралелно една спрямо друга.
            • Синхронизацията между отделните нишки трябва да става посредством
            mutex-и и condvar-и.
            • Симулирането на време става чрез използването на sleep() и
            condvar_timed_wait, в случаите, когато може да се изисква
            обработка на събития, докато се симулира време.
            • Не е нужно да се следи за ситуации, в които играчът не може да
            завърши успешно играта.
            • При приключване на играта трябва да изведе броя на първоначалните
            ресурси на картата, оставащите ресурси и общите събрани ресурси от
            играча. При правилно решение на задачата, сумата на събраните ресурси
            и оставащите ресурси ВИНАГИ ще е равна на първоначалните ресурси.
    */
    /*
        1.1.5 Примерна игра
            Game begins! Worker
            1 is searching
            Worker 1 is transporting
            Worker 1 unloaded resources to Base
            station Worker 2 is searching
            Worker 2 is transporting
            Worker 2 unloaded resources to Base
            station W
            Operation not supported
            Worker 3 is searching
            Worker 3 is transporting
            Worker 3 unloaded resources to Base
            station …..
            b
            Not enough resources
            Worker 4 is searching
            Worker 4 is transporting
            Worker 4 unloaded resources to Base station
            …
            b
            Worker 3 is constructing new building
            barracks Worker 2 is searching
            Worker 2 is transporting
            Worker 2 unloaded resources to Base
            station ….
            Worker 3 completed new building
            barracks w
            Warrior is being trained
            Worker 3 is searching
            Warrior is ready for duty
            ...
            
    */
    /*
        1.2 Обработка на грешки (20 точки)
            • При логически грешки от страна на играча трябва да се изведе съобщение за
            грешка и играта да се продължи. Пример за логическа грешка е строенето на
            войник, когато няма достатъчно събрани минерали или не е построена сграда.
            • Ако при извикване на pthread_create, pthread_mutex_init, и т.н. възникне
            грешка,трябва да се изведе съобщение за грешка и програмата да се прекрати.
    */
    /*
        1.3*** Поддръжка на N на брой работници (Бонус условие)
        Играчът има възможност да обучава работници от Командната база, чрез
        въвеждане на команда “c” на стандартния вход. Цената на един работник е 25
        ресурса и времето за обучение е 1s. При начало на обучение на работник трябва
        да се изведе съобщение „ Worker is being trained”. Само по един работник може да
        се обучава в даден момент от време в команднната база. След обучението на
        работник трябва да се извежда съобщението “Worker has been spawned”.
            ...
            Worker 2 is searching
            Worker 2 is transporting
            Worker 2 unloaded resources to Base
            station C
            Worker is being trained
            Worker 1 is searching
            Worker 1 is transporting
            Worker 1 unloaded resources to Base
            station Worker has been spawned
            Worker 6 is searching
            Worker 6 is transporting
            Worker 6 unloaded resources to Base station
            ...
            
*/
/*    2. Изисквания към решението и оценяване
        • Правилата за оценяване са следните. Приемаме, че напълно
        коректна и написана спрямо изискванията програма получава
        максималния брой точки 100% или 100 точки.
        • За работа с нишки трябва да се използва семейството от
        функции pthread_create(), pthread_mutex_init(), и т.н.
*/